# Item Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolicCurveArray..::..Item Property
SymbolicCurveArray Class See Also
---
Gets or sets a model curve at a specified index within the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual SymbolicCurve this[
	int index
] { get; set; }
```

Visual Basic
---
```text
Public Overridable Property Item ( _
	index As Integer _
) As SymbolicCurve
	Get
	Set
```

Visual C++
---
```text
public:
virtual property SymbolicCurve^ Item[int index] {
	SymbolicCurve^ get (int index);
	void set (int index, SymbolicCurve^ value);
}
```

# ### Parameters
index
    Type: System..::..Int32The index of the model curve to be set or retrieved.
# ### Return Value
Returns the model curve at the specified index.
# See Also
SymbolicCurveArray Class
Autodesk.Revit.DB Namespace